; domain
(define (domain snowman_adl)
    
    (:requirements
        :typing
        :negative-preconditions
        :equality
        :disjunctive-preconditions
        :conditional-effects
    )

    (:types 
        location direction ball size - object
    )

    (:predicates
        (snow ?l - location)
        (next ?from ?to - location ?dir - direction)
        (occupancy ?l - location)
        (character_at ?l - location)
        (ball_at ?b - ball ?l - location)
        (ball_size_small ?b - ball)
        (ball_size_medium ?b - ball)
        (ball_size_large ?b - ball)
        (goal)
    )
    
    (:action move_character
    
     :parameters
       (?from ?to - location ?dir - direction)

     :precondition
        (and
            (next ?from ?to ?dir)
            (character_at ?from)
            (not (occupancy ?to)))

     :effect
        (and
            (not (character_at ?from))
            (character_at ?to))
    )
    
    (:action move_ball

     :parameters
        (?b - ball ?ppos ?from ?to - location ?dir - direction)

     :precondition
        (and
            (next ?ppos ?from ?dir)
            (next ?from ?to ?dir)
            (ball_at ?b ?from)
            (character_at ?ppos)
            (forall (?o - ball)
                (or 
                    (= ?o ?b)
                    (or 
                        (not (ball_at ?o ?from))
                        (or 
                            (and
                                (ball_size_small ?b)
                                (ball_size_medium ?o))
                            (and
                                (ball_size_small ?b)
                                (ball_size_large ?o))
                            (and
                                (ball_size_medium ?b)
                                (ball_size_large ?o))))))
            (or
                (forall (?o - ball)
                    (or 
                        (= ?o ?b)
                        (not (ball_at ?o ?from))))
                (forall (?o - ball)
                        (not (ball_at ?o ?to))))
            (forall (?o - ball)
                    (or
                        (not (ball_at ?o ?to))
                        (or 
                            (and
                                (ball_size_small ?b)
                                (ball_size_medium ?o))
                            (and
                                (ball_size_small ?b)
                                (ball_size_large ?o))
                            (and
                                (ball_size_medium ?b)
                                (ball_size_large ?o))))))
      :effect
        (and
            (when
                (forall (?o - ball)
                    (or (= ?o ?b)
                    (ball_at ?o ?to)))
                (goal))
            (not (occupancy ?from))
            (occupancy ?to)
            (not (ball_at ?b ?from))
            (ball_at ?b ?to)
            (when
                (forall (?o - ball)
                    (or 
                        (= ?o ?b)
                        (not (ball_at ?o ?from))))
                (and
                    (not (character_at ?ppos))
                    (character_at ?from)))
            (not (snow ?to))
            (when
                (and
                    (snow ?to)
                    (ball_size_small ?b))
                (and
                    (not (ball_size_small ?b))
                    (ball_size_medium ?b)))
            (when
                (and
                    (snow ?to)
                    (ball_size_medium ?b))
                (and
                    (not (ball_size_medium ?b))
                    (ball_size_large ?b))))
    )
)

; problem
(define (problem toy05)
    (:domain snowman_adl)
    (:objects
        dir_right - direction
        dir_left - direction
        dir_up - direction
        dir_down - direction
        ball_0 - ball
        ball_1 - ball
        ball_2 - ball
        loc_1_1 - location
        loc_1_2 - location
        loc_1_3 - location
        loc_1_4 - location
        loc_2_1 - location
        loc_2_2 - location
        loc_2_3 - location
        loc_2_4 - location
        loc_3_1 - location
        loc_3_2 - location
        loc_3_3 - location
        loc_3_4 - location
        loc_4_1 - location
        loc_4_2 - location
        loc_4_3 - location
        loc_4_4 - location
    )
    (:init
        (next loc_1_1 loc_2_1 dir_right)
        (next loc_1_1 loc_1_2 dir_up)
        (next loc_1_2 loc_2_2 dir_right)
        (next loc_1_2 loc_1_3 dir_up)
        (next loc_1_2 loc_1_1 dir_down)
        (next loc_1_3 loc_2_3 dir_right)
        (next loc_1_3 loc_1_4 dir_up)
        (next loc_1_3 loc_1_2 dir_down)
        (next loc_1_4 loc_2_4 dir_right)
        (next loc_1_4 loc_1_3 dir_down)
        (next loc_2_1 loc_3_1 dir_right)
        (next loc_2_1 loc_1_1 dir_left)
        (next loc_2_1 loc_2_2 dir_up)
        (next loc_2_2 loc_3_2 dir_right)
        (next loc_2_2 loc_1_2 dir_left)
        (next loc_2_2 loc_2_3 dir_up)
        (next loc_2_2 loc_2_1 dir_down)
        (next loc_2_3 loc_3_3 dir_right)
        (next loc_2_3 loc_1_3 dir_left)
        (next loc_2_3 loc_2_4 dir_up)
        (next loc_2_3 loc_2_2 dir_down)
        (next loc_2_4 loc_3_4 dir_right)
        (next loc_2_4 loc_1_4 dir_left)
        (next loc_2_4 loc_2_3 dir_down)
        (next loc_3_1 loc_4_1 dir_right)
        (next loc_3_1 loc_2_1 dir_left)
        (next loc_3_1 loc_3_2 dir_up)
        (next loc_3_2 loc_4_2 dir_right)
        (next loc_3_2 loc_2_2 dir_left)
        (next loc_3_2 loc_3_3 dir_up)
        (next loc_3_2 loc_3_1 dir_down)
        (next loc_3_3 loc_4_3 dir_right)
        (next loc_3_3 loc_2_3 dir_left)
        (next loc_3_3 loc_3_4 dir_up)
        (next loc_3_3 loc_3_2 dir_down)
        (next loc_3_4 loc_4_4 dir_right)
        (next loc_3_4 loc_2_4 dir_left)
        (next loc_3_4 loc_3_3 dir_down)
        (next loc_4_1 loc_3_1 dir_left)
        (next loc_4_1 loc_4_2 dir_up)
        (next loc_4_2 loc_3_2 dir_left)
        (next loc_4_2 loc_4_3 dir_up)
        (next loc_4_2 loc_4_1 dir_down)
        (next loc_4_3 loc_3_3 dir_left)
        (next loc_4_3 loc_4_4 dir_up)
        (next loc_4_3 loc_4_2 dir_down)
        (next loc_4_4 loc_3_4 dir_left)
        (next loc_4_4 loc_4_3 dir_down)
        (character_at loc_1_4)
        (ball_at ball_0 loc_2_3)
        (ball_size_small ball_0)
        (ball_at ball_1 loc_2_4)
        (ball_size_small ball_1)
        (ball_at ball_2 loc_4_3)
        (ball_size_small ball_2)
        (snow loc_3_3)
        (snow loc_3_4)
        (snow loc_4_4)
        (occupancy loc_2_3)
        (occupancy loc_2_4)
        (occupancy loc_4_3)
    )
    (:goal
        (goal)
    )
)

; plan
1. (move_ball ball_1 loc_1_4 loc_2_4 loc_3_4 dir_right)
   deleted: (occupancy loc_2_4) (ball_at ball_1 loc_2_4) (character_at loc_1_4) (snow loc_3_4) (ball_size_small ball_1)
   added: (occupancy loc_3_4) (ball_at ball_1 loc_3_4) (character_at loc_2_4) (ball_size_medium ball_1)
   goals met: 0 of 1
2. (move_ball ball_1 loc_2_4 loc_3_4 loc_4_4 dir_right)
   deleted: (occupancy loc_3_4) (ball_at ball_1 loc_3_4) (character_at loc_2_4) (snow loc_4_4) (ball_size_medium ball_1)
   added: (occupancy loc_4_4) (ball_at ball_1 loc_4_4) (character_at loc_3_4) (ball_size_large ball_1)
   goals met: 0 of 1
3. (move_character loc_3_4 loc_2_4 dir_left)
   deleted: (character_at loc_3_4)
   added: (character_at loc_2_4)
   goals met: 0 of 1
4. (move_character loc_2_4 loc_1_4 dir_left)
   deleted: (character_at loc_2_4)
   added: (character_at loc_1_4)
   goals met: 0 of 1
5. (move_character loc_1_4 loc_1_3 dir_down)
   deleted: (character_at loc_1_4)
   added: (character_at loc_1_3)
   goals met: 0 of 1
6. (move_ball ball_0 loc_1_3 loc_2_3 loc_3_3 dir_right)
   deleted: (occupancy loc_2_3) (ball_at ball_0 loc_2_3) (character_at loc_1_3) (snow loc_3_3) (ball_size_small ball_0)
   added: (occupancy loc_3_3) (ball_at ball_0 loc_3_3) (character_at loc_2_3) (ball_size_medium ball_0)
   goals met: 0 of 1
7. (move_character loc_2_3 loc_2_2 dir_down)
   deleted: (character_at loc_2_3)
   added: (character_at loc_2_2)
   goals met: 0 of 1
8. (move_character loc_2_2 loc_3_2 dir_right)
   deleted: (character_at loc_2_2)
   added: (character_at loc_3_2)
   goals met: 0 of 1
9. (move_ball ball_0 loc_3_2 loc_3_3 loc_3_4 dir_up)
   deleted: (occupancy loc_3_3) (ball_at ball_0 loc_3_3) (character_at loc_3_2)
   added: (occupancy loc_3_4) (ball_at ball_0 loc_3_4) (character_at loc_3_3)
   goals met: 0 of 1
10. (move_character loc_3_3 loc_2_3 dir_left)
   deleted: (character_at loc_3_3)
   added: (character_at loc_2_3)
   goals met: 0 of 1
11. (move_character loc_2_3 loc_2_4 dir_up)
   deleted: (character_at loc_2_3)
   added: (character_at loc_2_4)
   goals met: 0 of 1
12. (move_ball ball_0 loc_2_4 loc_3_4 loc_4_4 dir_right)
   deleted: (occupancy loc_3_4) (ball_at ball_0 loc_3_4) (character_at loc_2_4)
   added: (ball_at ball_0 loc_4_4) (character_at loc_3_4)
   goals met: 0 of 1
13. (move_character loc_3_4 loc_3_3 dir_down)
   deleted: (character_at loc_3_4)
   added: (character_at loc_3_3)
   goals met: 0 of 1
14. (move_character loc_3_3 loc_3_2 dir_down)
   deleted: (character_at loc_3_3)
   added: (character_at loc_3_2)
   goals met: 0 of 1
15. (move_character loc_3_2 loc_4_2 dir_right)
   deleted: (character_at loc_3_2)
   added: (character_at loc_4_2)
   goals met: 0 of 1
16. (move_ball ball_2 loc_4_2 loc_4_3 loc_4_4 dir_up)
   deleted: (occupancy loc_4_3) (ball_at ball_2 loc_4_3) (character_at loc_4_2)
   added: (goal) (ball_at ball_2 loc_4_4) (character_at loc_4_3)
   goals met: 1 of 1
